Table of Contents
 Class OpenMessages
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Open messages collection
[Obfuscation(Feature = "renaming")]
[DataContract]
public class OpenMessages
Inheritance
object
OpenMessages
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpenMessages()
Constructor
public OpenMessages()
Properties
 ErrorMessages
List Error messages only
public List<ErrorMessage> ErrorMessages { get; }
Property Value
List<ErrorMessage>
 InformationMessages
List Information messages only
public List<InformationMessage> InformationMessages { get; }
Property Value
List<InformationMessage>
 Messages
List of messages
[DataMember]
public List<OpenMessage> Messages { get; set; }
Property Value
List<OpenMessage>
 WarningMessages
List Worning messages only
public List<WarningMessage> WarningMessages { get; }
Property Value
List<WarningMessage>
Methods
 Add(OpenMessage)
Add a message
public void Add(OpenMessage message)
Parameters
message OpenMessage
Message to be added
 Remove(OpenMessage)
Remove a message
public void Remove(OpenMessage message)
Parameters
message OpenMessage
Message will be removed
 Edit this page